{
  "courses": {
    "c1": {
      "qs": {
        "q001": {
          "rightAns": "His son",
          "explain":
            "The first statement of this reasoning is absolutely correct; if I have neither brothers nor sisters, then my father's son is indeed myself. But it doesn't follow that 'myself' is the answer to the problem. <br />If the second clause of the problem had been, 'this man is my father's son,' then the answer to the problem would have been 'myself'. But the problem didn't say that; it said 'this man's father is my father's son' From which it follows that this man's father is myself (since my father's son is myself). Since this man's father is myself, then I am this man's father, hence this man must be my son. <br />Thus the correct answer to the problem is that the man is looking at a picture of his son.",
          "hint": "hint 1",
          "id": "q001",
          "nxtQId": "q002",
          "q":
            "A man was looking at a portrait. Someone asked him, 'Whose picture are you looking at?' He replied: <br />'Brothers and sisters have I none, but this man's father is my father's son'. <br />Here 'This man's father' means, of course, the father of the man in the picture. <br />Whose picture was the man looking at?",
          "title": "The Portrait",
          "wrongAns1": "Himself",
          "wrongAns2": "His father",
          "wrongAns3": "His uncle"
        },
        "q002": {
          "rightAns": "Three",
          "explain":
            "The most common wrong answer is '25'. <br />If the problem had been, 'What is the smallest number I must pick in order to be sure of getting at least two socks of different colours,' then the correct answer would have been 25. But the problem calls for at least two socks of the same color, so the correct answer is 'three'. <br />If I pick three socks, then either they are all of the same color (in which case I certainly have at least two of the same color) or else two are of one color and the third is of the other color, so I then have two of the same color.",
          "hint": "hint 2",
          "id": "q002",
          "nxtQId": "q003",
          "q":
            "Twenty-four red socks and 24 blue socks are lying in a drawer in a dark room. <br />What is the minimum number of socks I must take out of the drawer which will guarantee that I have at least two socks of the same color?",
          "title": "Twenty-four Socks",
          "wrongAns1": "Twenty-four",
          "wrongAns2": "Twenty-five",
          "wrongAns3": "Two"
        },
        "q003": {
          "rightAns": "Yes",
          "explain":
            "Assume there are exactly 8 million people in New York. <br />If each inhabitant had a different number of hairs, then there would be 8 million different positive whole numbers each less than 8 million. This is impossible!",
          "hint": "hint 3",
          "id": "q003",
          "nxtQId": "q004",
          "q":
            "Given that there are more inhabitants of New York City than there are hairs on the head of any inhabitant, and that no inhabitant is totally bald, does it necessarily follow that there must be at least two inhabitants with exactly the same number of hairs?",
          "title": "Hair in New York",
          "wrongAns1": "No",
          "wrongAns2": "Unknowable",
          "wrongAns3": "Pass"
        },
        "q004": {
          "rightAns": "518",
          "explain":
            "Suppose there were more than 518 inhabitants — say 520. Then there would have to be 520 distinct numbers all less than 520 and none of them equal to 518. <br />This is impossible; there are exactly 520 distinct numbers (including zero) less than 520, hence there are only 519 numbers other than 518 which are less than 520.",
          "hint": "hint 4",
          "id": "q004",
          "nxtQId": "q005",
          "q":
            "In the town of Podunk, the following facts are true: <br />1) No two inhabitants have exactly the same number of hairs. <br />2) No inhabitant has exactly 518 hairs. <br />3) There are more inhabitants than there are hairs on the head of any one inhabitant. <br />What is the largest possible number of inhabitants of Podunk?",
          "title": "Hair in Podunk",
          "wrongAns1": "520",
          "wrongAns2": "517",
          "wrongAns3": "519"
        },
        "q005": {
          "rightAns": "B is a knave and C is a knight",
          "explain":
            "It is impossible for either a knight or a knave to say, 'I am a knave,' because a knight wouldn't make the false statement that he is a knave, and a knave wouldn't make the true statement that he is a knave. Therefore A never did say that he was a knave. So B lied when he said that A said that he was a knave. Hence B is a knave. <br />Since C said that B was lying and B was indeed lying, then C spoke the truth, hence is a knight. <br />Thus B is a knave and C is a knight but it is impossible to know what A is.",
          "hint": "hint 5",
          "id": "q005",
          "nxtQId": "q006",
          "q":
            "On the island of knights and knaves three of the inhabitants — A, B, and C — were standing together in a garden. <br />You pass by and asked A, 'Are you a knight or a knave?' A answered, but rather indistinctly, so the stranger could not make out what he said. The stranger then asked B, 'What did A say?' B replied, 'A said that he is a knave'. At this point the third man, C, said, 'Don't believe B; he is lying!'. <br />The question is, what are B and C?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "B is a knight and C is a knave",
          "wrongAns2": "B is a knave and C is a knave",
          "wrongAns3": "B is a knight and C is a knight"
        },
        "q006": {
          "rightAns": "B is a knave and C is a knight",
          "explain":
            "The first thing to observe is that B and C must be of opposite types, since B contradicts C. So of these two, one is a knight and the other a knave. Now, if A were a knight, then there would be two knights present, hence A would not have lied and said there was only one. On the other hand, if A were a knave, then it would be true that there was exactly one knight present; but then A, being a knave, couldn't have made that true statement. Therefore A could not have said that there was one knight among them. So B falsely reported A's statement, and thus B is a knave and C is a knight.",
          "hint": "hint 5",
          "id": "q006",
          "nxtQId": "q007",
          "q":
            "On the island of knights and knaves three of the inhabitants — A, B, and C — were standing together in a garden. <br />You pass by and asked A, 'Are you a knight or a knave?' A answered, but rather indistinctly, so the stranger could not make out what he said. So the stranger asks B, 'What did A say? B replies, 'A said that there is one knight among us' Then C says, 'Don't believe B; he is lying!'. <br />Now what are B and C?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "B is a knight and C is a knave",
          "wrongAns2": "B is a knave and C is a knave",
          "wrongAns3": "B is a knight and C is a knight"
        },
        "q007": {
          "rightAns": "A is a knight and B is a knave",
          "explain":
            "Suppose A were a knave. Then the statement 'At least one of us is a knave' would be false (since knaves make false statements); hence they would both be knights. <br />Thus, if A were a knave he would also have to be a knight, which is impossible. <br />Therefore A is not a knave; he is a knight. <br />Therefore his statement must be true, so at least one of them really is a knave. Since A is a knight, then B must be the knave. <br />So A is a knight and B is a knave.",
          "hint": "hint 5",
          "id": "q007",
          "nxtQId": "q008",
          "q":
            "On the island of knights and knaves two of the inhabitants, A and B, each of whom is either a knight or a knave, were standing together in a garden. A makes the following statement: <br />'At least one of us is a knave' <br />What are A and B?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "A is a knave and B is a knight",
          "wrongAns2": "A is a knave and B is a knave",
          "wrongAns3": "A is a knight and B is a knight"
        },
        "q008": {
          "rightAns": "A is a knight and B is a knight",
          "explain":
            "A made a statement of the disjunctive type: 'Either I am a knave or B is a knight' <br />Suppose A is a knave. Then the above statement must be false. This means that it is neither true that A is a knave nor that B is a knight. So if A were a knave, then it would follow that he is not a knave—which would be a contradiction. Therefore A must be a knight. <br />Having thus established that A is a knight, we know his statement is true that at least one of the possibilities holds: <br />(1) A is a knave; <br />(2) B is a knight. <br />Since possibility (1) is false (since A is a knight) then possibility (2) must be the correct one, i.e., B is a knight. Hence A and B are both knights.",
          "hint": "hint 5",
          "id": "q008",
          "nxtQId": "q009",
          "q":
            "On the island of knights and knaves two of the inhabitants, A and B, each of whom is either a knight or a knave, were standing together in a garden. A makes the following statement: <br />'Either I am a knave or B is a knight'. <br />What are A and B?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "A is a knave and B is a knight",
          "wrongAns2": "A is a knave and B is a knave",
          "wrongAns3": "A is a knight and B is a knave"
        },
        "q009": {
          "rightAns": "A is a knave, B is a knight, and C is a knave",
          "explain":
            "A must be a knave, for if he were a knight, then it would be true that all three are knaves and hence that A too is a knave. If A were a knight he would have to be a knave, which is impossible. So A is a knave. Hence his statement was false, so in fact there is at least one knight among them. Now, suppose B were a knave. Then A and B would both be knaves, so C would be a knight (since there is at least one knight among them). This would mean that there was exactly one knight among them, hence B's statement would be true. We would thus have the impossibility of a knave making a true statement. Therefore B must be a knight. We now know that A is a knave and that B is a knight. Since B is a knight, his statement is true, so there is exactly one knight among them. This knight must be B, hence C must be a knave. Thus the answer is that A is a knave, B is a knight, and C is a knave.",
          "hint": "hint 5",
          "id": "q009",
          "nxtQId": "q010",
          "q":
            "On the island of knights and knaves three of the inhabitants -A, B and C- each of whom is either a knight or a knave, were standing together in a garden. <br />A says, 'All of us are knaves'<br />B says, 'Exactly one of us is a knight'. <br />What are A, B and C?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "A is a knight, B is a knave, and C is a knave",
          "wrongAns2": "A is a knave, B is a knave, and C is a knight",
          "wrongAns3": "A is a knight, B is a knave, and C is a knight"
        },
        "q010": {
          "rightAns": "B is unknown, and C is a knight",
          "explain":
            "A must be a knave for the same reasons as in the preceding problem; hence also there is at least one knight among them. <br />Now, either B is a knight or a knave. Suppose he is a knight. Then it is true that exactly one of them is a knave. This only knave must be A, so C would be a knight. So if B is a knight, so is C. <br />On the other hand, if B is a knave, then C must be a knight, since all three can't be knaves (as we have seen). <br />So in either case, C must be a knight but we cannot be determined what B is.",
          "hint": "hint 5",
          "id": "q010",
          "nxtQId": "q011",
          "q":
            "On the island of knights and knaves three of the inhabitants -A, B and C- each of whom is either a knight or a knave, were standing together in a garden. <br />A says, 'All of us are knaves'<br /> B says, 'Exactly one of us is a knave'. <br />Can it be determined what B is? Can it be determined what C is?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "B is a knave, and C is a unknown",
          "wrongAns2": "B is a knight, and C is a knave",
          "wrongAns3": "B is a knave, and C is a knight"
        },
        "q011": {
          "rightAns": "A is a knave and B is a knave",
          "explain":
            "A can't be a knight or his statement would be true, in which case he would have to be a knave. Therefore A is a knave. Hence also his statement is false. <br />If B were a knight, then A's statement would be true. Hence B is also a knave. So A and B are both knaves.",
          "hint": "hint 5",
          "id": "q011",
          "nxtQId": "q012",
          "q":
            "On the island of knights and knaves three of the inhabitants -A, B and C- each of whom is either a knight or a knave, were standing together in a garden. <br />A says, 'I am a knave, but B isn't'<br />B says, 'Exactly one of us is a knave'. <br />What are A and B?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "A is a knave and B is a knight",
          "wrongAns2": "A is a knight and B is a knight",
          "wrongAns3": "A is a knight and B is a knave"
        },
        "q012": {
          "rightAns": "C is a knave.",
          "explain":
            "Suppose A is a knight. Then his statement that B is a knave must be true, so B is then a knave. Hence B's statement that A and C are of the same type is false, so A and C are of different types. Hence C must be a knave (since A is a knight). Thus if A is a knight, then C is a knave. <br />On the other hand, suppose A is a knave. Then his statement that B is a knave is false, hence B is a knight. Hence B's statement is true that A and C are of the same type. This means that C must be a knave (since A is). <br />We have shown that regardless of whether A is a knight or a knave, C must be a knave.",
          "hint": "hint 5",
          "id": "q012",
          "nxtQId": "q001",
          "q":
            "On the island of knights and knaves three of the inhabitants -A, B and C- each of whom is either a knight or a knave, were standing together in a garden. <br />A says, 'B is a knave'<br />B says, 'A and C are of the same type'. <br />What is C?",
          "title": "The Island of Knights and Knaves",
          "wrongAns1": "C is a knight.",
          "wrongAns2": "C is unknown.",
          "wrongAns3": "C is neither a knight nor knave."
        }
      }
    },
    "c2": {
      "qs": {
        "q001": {
          "rightAns": "unhindered path",
          "explain": "explain 1",
          "hint": "hint 1",
          "id": "q001",
          "arrayKey": 0,
          "q": "How can you NOT say 'Hindernis' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "obstacle",
          "wrongAns2": "barrier",
          "wrongAns3": "hurdle"
        },
        "q002": {
          "rightAns": "to be left wanting",
          "explain": "explain 2",
          "hint": "hint 2",
          "id": "q002",
          "arrayKey": 1,
          "q": "How can you NOT say 'zufrieden sein' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "to be happy with",
          "wrongAns2": "to be content",
          "wrongAns3": "to be satisfied"
        },
        "q003": {
          "rightAns": "from now",
          "explain": "explain 3",
          "hint": "hint 3",
          "id": "q003",
          "arrayKey": 2,
          "q": "How can you NOT say 'bisher' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "so far",
          "wrongAns2": "until now",
          "wrongAns3": "up to this moment"
        },
        "q004": {
          "rightAns": "to be strict",
          "explain": "explain 4",
          "hint": "hint 4",
          "id": "q004",
          "arrayKey": 3,
          "q":
            "How can you NOT say 'eigensinnig sein / rechthabend' in English?",
          "score": -25,
          "title": "Choose the right option.",
          "wrongAns1": "to be unopinionated",
          "wrongAns2": "to be agnostic",
          "wrongAns3": "to be flexible"
        },
        "q005": {
          "rightAns": "proof",
          "explain": "explain 5",
          "hint": "hint 5",
          "id": "q005",
          "arrayKey": 4,
          "q": "How can you NOT say 'versuch' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "trial",
          "wrongAns2": "experiment",
          "wrongAns3": "test"
        },
        "q006": {
          "rightAns": "superfluous",
          "explain": "explain 6",
          "hint": "hint 6",
          "id": "q006",
          "arrayKey": 5,
          "q": "What is the opposite of 'useful'?",
          "title": "Choose the right option.",
          "wrongAns1": "handy",
          "wrongAns2": "practical",
          "wrongAns3": "helpful"
        },
        "q007": {
          "rightAns": "easy",
          "explain": "explain 7",
          "hint": "hint 7",
          "id": "q007",
          "arrayKey": 6,
          "q": "What is the opposite of 'difficult'?",
          "title": "Choose the right option.",
          "wrongAns1": "hard",
          "wrongAns2": "tricky",
          "wrongAns3": "tough"
        },
        "q008": {
          "rightAns": "cheap",
          "explain": "explain 8",
          "hint": "hint 8",
          "id": "q008",
          "nxtQarrayKeyId": 7,
          "q": "What is the opposite of 'expensive'?",
          "title": "Choose the right option.",
          "wrongAns1": "costly",
          "wrongAns2": "dear",
          "wrongAns3": "pricey"
        },
        "q009": {
          "rightAns": "dark",
          "explain": "explain 9",
          "hint": "hint 9",
          "id": "q009",
          "arrayKey": 8,
          "q": "What is the opposite of 'bright'?",
          "title": "Choose the right option.",
          "wrongAns1": "light",
          "wrongAns2": "brilliant",
          "wrongAns3": "sunny"
        },
        "q010": {
          "rightAns": "difficult",
          "explain": "explain 10",
          "hint": "hint 10",
          "id": "q010",
          "arrayKey": 9,
          "q": "What is the opposite of 'painless'?",
          "title": "Choose the right option.",
          "wrongAns1": "easy",
          "wrongAns2": "smooth",
          "wrongAns3": "effortless"
        },
        "q011": {
          "rightAns": "rich",
          "explain": "explain 11",
          "hint": "hint 11",
          "id": "q011",
          "arrayKey": 10,
          "q": "What is the opposite of 'poor'?",
          "title": "Choose the right option.",
          "wrongAns1": "wealthy",
          "wrongAns2": "prosperous",
          "wrongAns3": "well-off"
        },
        "q012": {
          "rightAns": "tired",
          "explain": "explain 12",
          "hint": "hint 12",
          "id": "q012",
          "arrayKey": 11,
          "q": "What is the opposite of 'energetic'?",
          "title": "Choose the right option.",
          "wrongAns1": "awake",
          "wrongAns2": "up",
          "wrongAns3": "fresh"
        },
        "q013": {
          "rightAns": "nice",
          "explain": "explain 13",
          "hint": "hint 13",
          "id": "q013",
          "arrayKey": 12,
          "q": "What is the opposite of 'horrible'?",
          "title": "Choose the right option.",
          "wrongAns1": "nasty",
          "wrongAns2": "cruel",
          "wrongAns3": "unkind"
        },
        "q014": {
          "rightAns": "late",
          "explain": "explain 14",
          "hint": "hint 14",
          "id": "q014",
          "arrayKey": 13,
          "q": "What is the opposite of 'early'?",
          "title": "Choose the right option.",
          "wrongAns1": "fresh",
          "wrongAns2": "seen",
          "wrongAns3": "on time"
        },
        "q015": {
          "rightAns": "strong",
          "explain": "explain 15",
          "hint": "hint 15",
          "id": "q015",
          "arrayKey": 14,
          "q": "What is the opposite of 'weak'?",
          "title": "Choose the right option.",
          "wrongAns1": "fragile",
          "wrongAns2": "feeble",
          "wrongAns3": "faint"
        },
        "q016": {
          "rightAns": "excited",
          "explain": "explain 16",
          "hint": "hint 16",
          "id": "q016",
          "arrayKey": 15,
          "q": "What is the opposite of 'bored'?",
          "title": "Choose the right option.",
          "wrongAns1": "tired",
          "wrongAns2": "disinterested",
          "wrongAns3": "fatigued"
        },
        "q017": {
          "rightAns": "naughty",
          "explain": "explain 17",
          "hint": "hint 17",
          "id": "q017",
          "arrayKey": 16,
          "q": "What is the opposite of 'well-behaved'?",
          "title": "Choose the right option.",
          "wrongAns1": "polite",
          "wrongAns2": "good",
          "wrongAns3": "respectful"
        },
        "q018": {
          "rightAns": "noisy",
          "explain": "explain 18",
          "hint": "hint 18",
          "id": "q018",
          "arrayKey": 17,
          "q": "What is the opposite of 'quiet'?",
          "title": "Choose the right option.",
          "wrongAns1": "peaceful",
          "wrongAns2": "still",
          "wrongAns3": "silent"
        },
        "q019": {
          "rightAns": "not eating too much",
          "explain": "explain 19",
          "hint": "hint 19",
          "id": "q019",
          "arrayKey": 18,
          "q": "Choose the good habit",
          "title": "Choose the right option.",
          "wrongAns1": "smoking",
          "wrongAns2": "being late every day",
          "wrongAns3": "sleeping too much"
        },
        "q020": {
          "rightAns": "up to",
          "explain": "explain 20",
          "hint": "hint 20",
          "id": "q020",
          "arrayKey": 19,
          "q": "I could eat _______ 1700K a day. ",
          "title": "Choose the right option.",
          "wrongAns1": "until",
          "wrongAns2": "'til",
          "wrongAns3": "for"
        },
        "q021": {
          "rightAns": "cheap",
          "explain": "explain 21",
          "hint": "hint 21",
          "id": "q021",
          "arrayKey": 20,
          "q": "Which is NOT a synonym of 'expensive'?",
          "title": "Choose the right option.",
          "wrongAns1": "costly",
          "wrongAns2": "extravagant",
          "wrongAns3": "pricey"
        },
        "q022": {
          "rightAns": "fundamental",
          "explain": "explain 22",
          "hint": "hint 22",
          "id": "q022",
          "arrayKey": 21,
          "q":
            "Which is a synonym of 'necessary' in the context of web development?",
          "title": "Choose the right option.",
          "wrongAns1": "voluntary",
          "wrongAns2": "optional",
          "wrongAns3": "extra"
        },
        "q023": {
          "rightAns": "insignificant",
          "explain": "explain 23",
          "hint": "hint 23",
          "id": "q023",
          "arrayKey": 22,
          "q":
            "Which is NOT a synonym of 'important' in the context of web development?",
          "title": "Choose the right option.",
          "wrongAns1": "critical",
          "wrongAns2": "essential",
          "wrongAns3": "vital"
        },
        "q024": {
          "rightAns": "dense",
          "explain": "explain 24",
          "hint": "hint 24",
          "id": "q024",
          "arrayKey": 23,
          "q": "How CAN'T you say 'schnell' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "rapid",
          "wrongAns2": "quick",
          "wrongAns3": "fast"
        },
        "q025": {
          "rightAns": "to be particular",
          "explain": "explain 25",
          "hint": "hint 25",
          "id": "q025",
          "arrayKey": 24,
          "q": "How do you say 'besonders sein' in English?",
          "title": "Choose the right option.",
          "wrongAns1": "to be general",
          "wrongAns2": "to be nonspecific",
          "wrongAns3": "to be usual"
        }
      }
    }
  },
  "users": {}
}
